# ========================================================================================
# ОСНОВНЫЕ НАСТРОЙКИ СИСТЕМЫ
# ========================================================================================
# Эти параметры используются во многих модулях

NUM_THREADS = 100  # если больше 100, нужно добавить больше rpc для перебора, не меньше 5 (чем больше тем лучше)
SLEEP_BETWEEN_ACTIONS = [5, 8]  # Задержка между действиями
TX_SEND_ATTEMPTS = 1  # Количество попыток отправки транзакции
RETRY_COUNT = 5  # Количество попыток в случае ошибки | замен прокси, rpc и т.д.

# ========================================================================================
# CAPTCHA SETTINGS
# ========================================================================================
astrum_CAPTCHA_API_KEY = ''  # API ключ для решения капчи (Astrum Solver) получать в https://t.me/astrumsolutionsbot
CAPSOLVER_API_KEY = ''  # API ключ для CapSolver (альтернативный сервис) - https://www.capsolver.com/

# Выбор сервиса решения капчи: 'astrum' или 'capsolver'
# Если 'astrum' не работает, попробуйте 'capsolver'
CAPTCHA_SERVICE = 'astrum'  # 'astrum' или 'capsolver'

# ========================================================================================
# ПРОВЕРКА СТАТУСА ТРАНЗАКЦИЙ
# ========================================================================================
WHAITE_TRANSACTION_PENDING = 10  # Количество секунд ожидания ожидания подтверждения транзакции "Pending" (0 ставить не советую, минимум 5)
WHAITE_TRANSACTION_PENDING_COUNT = 10  # Количество попыток проверки транзакции которая в "Pending"

# ========================================================================================
# ОСНОВНЫЕ ПРОКСИ И КОШЕЛЬКИ
# ========================================================================================
MAIN_PROXY = ''  # Основной прокси (если используется), ожидая всяких запросов, в которых не требуется прокси (опционально)
EVM_MAIN_WALLET = ''  # Основной кошелек ETH (если используется)
SOL_MAIN_WALLET = ''  # Основной кошелек Solana (если используется)
