# ========================================================================================
# НАСТРОЙКИ ФУНКЦИИ УВЕДОМЛЕНИЙ (общее, настраивать если отдельно в модуле нет уведомлений)
# ========================================================================================
ENABLE_NOTIFICATIONS = False  # Включить/выключить уведомления

# ========================================================================================
# TELEGRAM
# ========================================================================================
TELEGRAM_BOT_TOKEN = ''  # Токен вашего Telegram бота
TELEGRAM_CHAT_ID = []  # ID чата для отправки уведомлений (в формате списка, например: [123456789, 987654321])
