# =========================================================================================
# НАСТРОЙКИ ФУНКЦИИ SPOT TRADE
# =========================================================================================
# BASE_TYPE -- 'local' - локальная база данных, 'remote' - удаленная база данных mysql
BASE_TYPE = 'local'  # Тип базы для спот торговли (local или remote)
BASE_NAME = 'spot_trade'  # Имя базы данных для спот торговли (если BASE_TYPE = 'remote', то имя базы данных на удаленном сервере)
TOKEN_TO_BUY_FOR = 'USDT'
TOKEN_TO_BUY = ['ETH', 'BTC', 'SOL', 'ARB', 'LTC', 'XRP', 'TRX']
PROCENT_TO_BUY_SELL = [3, 5]  # Процент для покупки при падении за сутки, 2 значение процент при котором продавать при росте от изначальной цены покупки

SUM_OR_PROCENT_TO_BUY = {
    'type_buy': 'sum',  # Переключаемся на фиксированную сумму для надежности sum/percent
    'sum': [5.0, 7.0],  # если в usdt
    'percent': [7, 10]  # Если в %
}

TIME_TO_CHECK_PRICE = [30, 50]  # Время для проверки (в секундах) - рандомный интервал между проверками стоимости токенов

# ========================================================================================
# TELEGRAM УВЕДОМЛЕНИЯ ДЛЯ SPOT TRADE
# ========================================================================================
SPOT_TRADE_ENABLE_NOTIFICATIONS = False  # Включить уведомления для спот торговли
SPOT_TRADE_TELEGRAM_BOT_TOKEN = ''
SPOT_TRADE_TELEGRAM_CHAT_ID = []  # ID чата для отправки уведомлений (в формате списка, например: [123456789, 987654321])
