# ========================================================================================
# НАСТРОЙКИ PASSWORD_GENERATOR
# ========================================================================================
USE_SPECIAL_CHARACTERS = True  # Использовать специальные символы в паролях
EXCLUDE_CHARACTERS = ['0', 'O', 'I', 'l']  # Символы, которые нужно исключить из генерации паролей
USE_OF_SYMBOLS_IS_MANDATORY = ['!',]  # какой символ должен быть в пароле (если пустой, то не обязательно)
PASSWORD_LENGTH = [12, 16]  # Длина пароля (минимальная и максимальная длина)
COUNT_GENERATED_PASSWORDS = 10  # Количество генерируемых паролей за один запуск скрипта
