# ========================================================================================
# НАСТРОЙКИ ГЕНЕРАЦИИ "КРАСИВЫХ" АДРЕСОВ
# ========================================================================================
# Список слов для поиска в "красивых" адресах
NICE_ADDRESS_WORDS_ETH = [
    '0'*10, '1'*10, '2'*10, '3'*10, '4'*10,
    '5'*10, '6'*10, '7'*10, '8'*10, '9'*10,
    'a'*10, 'b'*10, 'c'*10, 'd'*10, 'e'*10, 'f'*10
]
NICE_ADDRESS_WORDS_SOL = [
    'A'*10, 'B'*10, 'C'*10, 'D'*10, 'E'*10, 'F'*10, 'G'*10, 'H'*10, 'J'*10, 'K'*10,
    'L'*10, 'M'*10, 'N'*10, 'P'*10, 'Q'*10, 'R'*10, 'S'*10, 'T'*10, 'U'*10, 'V'*10,
    'W'*10, 'X'*10, 'Y'*10, 'Z'*10, '2'*10, '3'*10, '4'*10, '5'*10, '6'*10, '7'*10
]

# ========================================================================================
# ПАРАМЕТРЫ ПОИСКА "КРАСИВЫХ" АДРЕСОВ
# ========================================================================================
REPEATED_CHAR_COUNT = 10  # Например, 4 означает поиск "aaaa", "bbbb" и т.д.
# Если включить и NICE_ADDRESS_WORDS_enable и REPEATED_CHAR_COUNT_enable, будет соблюдаться два правила
REPEATED_CHAR_COUNT_enable = True  # Включить/выключить поиск по повторяющимся символам
NICE_ADDRESS_WORDS_enable = False  # Включить/выключить поиск по словам

display_the_address_search_process = True  # Включить/выключить отображение процесса поиска адресов
