# ========================================================================================
# ПРОВЕРКА ПОЧТ ЧЕРЕЗ IMAP
# ========================================================================================
ENABLE_SEARCH_EMAIL = False  # Включить/выключить отправку писем почты через IMAP (True/False)
IMAP_SERVER = 'imap.mail.ru'  # IMAP сервер (например, imap.mail.ru для mail.ru, imap.yandex.ru для yandex.ru)
MAIN_MAIL = ''  # Для тестовой отправки писем email:password
PROXY = ''  # Прокси для подключения к почте (если требуется) log:password@ip:port
                # если не требуется, оставить пустым '' или None
