# ========================================================================================
# ГЕНЕРАТОР НИКНЕЙМОВ
# ========================================================================================
NICKNAME_GENERATOR = {
    'MIN_LENGTH': 10,        # Минимальная длина никнейма
    'MAX_LENGTH': 15,       # Максимальная длина никнейма
    'USE_SPECIAL_CHARS': False,  # Использовать специальные символы (_-.)
    'QUANTITY': 10000,          # Количество никнеймов для генерации
    'USE_NUMBERS': True,        # Обязательно использовать числа в никнейме
    'MIN_NUMBERS': 1,           # Минимальное количество чисел
    'MAX_NUMBERS': 3,           # Максимальное количество чисел
    'NICE_NUMBERS': [7, 13, 21, 27, 69, 77, 88, 99, 123, 777, 999]  # Красивые числа для использования
}


# ========================================================================================
# ГЕНЕРАТОР ПОЛНЫХ ИМЁН (ИМЯ + ФАМИЛИЯ)
# ========================================================================================
FULLNAME_GENERATOR = {
    'QUANTITY': 1000,  # Количество генерируемых вариантов имя+фамилия
}
