# ========================================================================================
# НАСТРОЙКИ ФУНКЦИИ ВЫВОДА CEX
# ========================================================================================
TYPE_WITHDRAW = 0  # 1 - выводить в USDT, 0 - в натике (конвертирует сумму в еквивалент USDT)
            # 1 - выводить в USDT
            # 0 - в натике
            # напрмер если 1 и VALUES_TO_WITHDRAW = [0.01, 0.1] то будет выведено 0.01-0.1 USDT, если 0 то будет выведено 0.01-0.1 в натике
VALUES_TO_WITHDRAW = [0.0024, 0.0025]  # Сумма для вывода (в натике) - рандомный интервал между 0.1 и 0.2
WAIT_FOR_BALANCE = True  # Ожидать, пока не будет найден баланс на кошельке после вывода (если в течении часа не пришел баланс, остановить)
